Raw-wrk-files/run-3/update/ringojs-convenient/raw
Welcome to Ubuntu 12.04.3 LTS (GNU/Linux 3.9.0-030900-generic x86_64)

 * Documentation:  https://help.ubuntu.com/

  System information as of Mon Oct 21 18:19:04 PDT 2013

  System load:  0.16               Processes:           120
  Usage of /:   5.8% of 129.62GB   Users logged in:     0
  Memory usage: 3%                 IP address for eth1: 172.16.98.98
  Swap usage:   0%

  Graph this data and manage this system at https://landscape.canonical.com/

64 packages can be updated.
24 updates are security updates.


---------------------------------------------------------
 Running Primer ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 5 -c 8 -t 8 http://tfbapp:8080/updates/2
---------------------------------------------------------

Running 5s test @ http://tfbapp:8080/updates/2
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.28ms  492.29us   9.34ms   92.66%
    Req/Sec   467.61     69.55   666.00     73.65%
  17570 requests in 5.00s, 3.71MB read
Requests/sec:   3513.18
Transfer/sec:    760.15KB

---------------------------------------------------------
 Running Warmup ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/2
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/2
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    33.64ms   12.65ms 203.93ms   81.12%
    Req/Sec     0.95k    84.89     1.35k    84.51%
  113683 requests in 15.00s, 24.02MB read
Requests/sec:   7578.05
Transfer/sec:      1.60MB

---------------------------------------------------------
 Queries: 1 for ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/1
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/1
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.73ms   13.43ms 691.70ms   83.70%
    Req/Sec     1.37k   163.26     2.62k    81.48%
  160439 requests in 15.00s, 28.88MB read
Requests/sec:  10695.31
Transfer/sec:      1.93MB

---------------------------------------------------------
 Queries: 5 for ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/5
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/5
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    66.20ms   46.82ms 814.20ms   87.35%
    Req/Sec   496.63     65.04   707.00     86.54%
  59283 requests in 15.00s, 18.15MB read
  Non-2xx or 3xx responses: 8
Requests/sec:   3951.08
Transfer/sec:      1.21MB

---------------------------------------------------------
 Queries: 10 for ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/10
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/10
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   113.41ms  107.63ms 785.75ms   84.59%
    Req/Sec   281.07     46.07   436.00     70.28%
  33832 requests in 15.00s, 16.36MB read
  Non-2xx or 3xx responses: 637
Requests/sec:   2254.90
Transfer/sec:      1.09MB

---------------------------------------------------------
 Queries: 15 for ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/15
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/15
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.11ms  255.21ms   1.69s    69.82%
    Req/Sec    97.55     33.61   305.00     81.64%
  12177 requests in 15.03s, 9.46MB read
  Non-2xx or 3xx responses: 1983
Requests/sec:    810.34
Transfer/sec:    644.84KB

---------------------------------------------------------
 Queries: 20 for ringojs-convenient
 wrk -H 'Host: localhost' -H 'Accept: application/json,text/html;q=0.9,application/xhtml+xml;q=0.9,application/xml;q=0.8,*/*;q=0.7' -H 'Connection: keep-alive' -d 15 -c 256 -t 8 http://tfbapp:8080/updates/20
---------------------------------------------------------

Running 15s test @ http://tfbapp:8080/updates/20
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   646.14ms  410.68ms   2.45s    72.11%
    Req/Sec    48.29      9.76    92.00     78.19%
  5994 requests in 15.03s, 6.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
  Non-2xx or 3xx responses: 2363
Requests/sec:    398.73
Transfer/sec:    447.86KB